# 1) კომენტარი --> გამოიყენება, პითონში რაიმეს ასახსნელად, მეტად წაკითხვადი და მარტივი მოსაძებნიც, რომ იყოს. მაგ: დამკვეთისგან შემოგვივიდა შეკვეთა და ჩვენი კოდი შედგება 5000 სტრიქონისგან, ჩვენ შეგვიძლია დავაკომენტაროთ რა ნაწილს სად ვიწყებთ სად ვასრულებთ, თუ რაიმე არ იმუშავებს ან იმუშავებს საცდელადაც(კოდის გასატესტად) ძალიან კარგი გამოსაყენებელია, ასევე, ბევრად უადვილებს უცხო თვალსაც მიაგნოს სასურველ ადგილს და ახსნას, თუ მაგალითად ჯგუფში მუშაობ სხვასთან ერთად კოდზე, რაღაც სიტუაციაა და ვერ ახერხებთ დაკონტაქტებას, მას უნდა შეეძლოს ზედმეტი დროის დაკარგვის გარეშე მარტივად მიაგნოს საჭირო ადგილს. 
# 2) case-sensitive --> პითონი არის ძალიან მგრძნობიარე ენა,განსხვავებულად აღიქვამს დიდსა და პატარა ასოებს "A და "a". მაგ: აქ იგულისხმება, რომ ცვლადები ძალიან სენსიტიურია სახელის დარქმევის დროს, მაგ: Name, NAME და name - 3 განსხვავებული ცვლადია, ამიტომაც საჭიროებს მეტ ყურადღებას. 
# 3) snake_case --> როდესაც საქმე გვაქვს ერთზე მეტ სიტყვიან ცვლადის სახელთან საჭიროა მათი ერთად დაწერა რადგან პითონი ვერ აღიქვამს ისე როგორც შეიძლება ჩვენ ჩაგვეფიქრებინა მაგ:  favorite color - ეს ცალ-ცალკე და არ შეიძლება, მარტო favorite არაფერს გვეუბნება რაზეა საუბარი, იქნებ საჭმელზე, იქნებ სიმღერაზე, ფილმზე ან სხვა. არც მხოლოდ color - მიგვანიშნებს რამეს ფერი შეიძლება იყოს ათასნაირი, მაგრამ საკითხი დასმულია ისე, რომ მაინტერესებს კონკრეტულად საყვარელი ფერი, იმისათვის, რომ ეს ერთად დავწეროთ საჭიროა შემოვიტანოთ _(ქვედა ტირე) --> favorite_color, My_husband_name და ა.შ.
# მაგალითები:
name_surname = "Mariam Dzadzua"
personal_id = "01234567891"
Married_or_not = "Married"
Mobile_number = "555-666-777"
My_age= "26"
level_in_Goa = "Level 04"
print("I am" + " " + name_surname + " " + "from Tbilsi" + "," + " " + "my personal number is" + " " + personal_id + "," + " " + "I got" + " " + Married_or_not + " " + "at the age of 25" + " "+ "," +"and I'm" + " " + My_age + " " + "now" + "," + " " + "my mobile number is" + " " + Mobile_number + "," + " " + "I'm currently on" + " " + level_in_Goa + " " + "at Goal-oriented academy.")

# 4) bug --> ინგლისურიდა სიტყვა-სიტყვით, რომ ვთარგმნოთ არის "ბაღლინჯო, ხოჭო, მწერი" - 1947 ჰარვარდის უნივერსიტეტის კომპიუტერის გაუმართაობის გამო, მათ გახსნეს შიგთავსი და აღმოაჩინეს რომ კომპიუტერმა იმიტომ გაჭედა და მიატოვა მუშაობა, რომ მასში გაჭედილი იყო რეალური ხოჭო, სწორედ აქედან წამოვიდა ეს სახელწოდება. დღეს-დღეისობით ეს ტერმინი გამოიყენება კომპიუტერული შეცდომების აღსაწერად computer bug ან უბრალოდ bug. მისი გამოსასწორებელი ტერმინი კი არის debugging - რაც ნიშნავს, პროცესს, რომლის დროსაც ჩვენ ვეძებთ პრობლემას და ვცდილობთ მის გამოსწორება/მოგავრებას.
# 5)  გამოვასწოროთ შეცდომები:
#  print("Hello World)
# city --> "London"
# pritn(City)
# გასწორებული ვერსია ->
print("Hello World") # შეცდომა იყო დაშვებული იმაში, რომ არ იყო ბრჭყალი (quotation mark) დახურული.
city = "London" # შეცდომა იყო --> ამ ისარში, უნდა ყოფილიყო ტოლობა (= equal symbol) 
print(city) # აქ შეცდომა იყო სიტყვაში "print" - ეწერა "pritn", ასევე ის რომ case_sensitive არის ენა და City და city განსხვავებული ცვლადებია, განსხვავება დიდ "C"-სა და პატარა "c"-შია. 